Repository: dan21321/Word_Generator
Catalog: Resources/Strings.*.resx
Languages: ru

# BtnAddPlaceholder
source: Add placeholder
ru: Добавить плейсхолдер

# AppName
source: Word Generator
ru: Генератор Word

# TxtLogCreateDoc
source: Document created:
ru: Создан документ:

# BtnGenerate
source: Generate document
ru: Сгенерировать документ

# BtnHelp
source: Help
ru: Помощь

# BtnRemovePlaceholder
source: Remove placeholder
ru: Удалить плейсхолдер

# BtnSelectExcel
source: Select Excel
ru: Выбрать Excel

# BtnSelectWord
source: Select a Word template
ru: Выбрать шаблон Word

# ChkAutoNumber
source: Automatic file numbering
ru: Автоматическая нумерация файлов

# PlaceholdersGrid
source: Placeholders and corresponding Excel columns:
ru: Плейсхолдеры и соответствующие колонки Excel:

# PlaceholderInWord
source: Placeholders in Word
ru: Плейсхолдеры в Word

source: Column Excel
ru: Колонка Excel

# BtnSelectOutput
source: Open folder for files
ru: Открыть папку для файлов

# ErrorExcel
source: Error reading Excel:
ru: Ошибка при чтении Excel:

# ErrorSelectFiles
source: Select all files and folder for output!
ru: Выберите все файлы и папку для вывода!

# ErrorConvert
source: Error converting .doc -> .docx:
ru: Ошибка при конвертации .doc -> .docx:

# TxtFinishGenerate
source: Generate complete!
ru: Генерация завершена!

source: Error:
ru: Ошибка:

# TxtEmailCopy
source: Email copied to clipboard!
ru: Почта скопирована в буфер обмена!

source: OK
ru: Готово

# HelpWindowText
source: HOW TO WORK WITH THE PROGRAM? 1. Select a Word template (.doc, .docx) that contains placeholders, for example: {{NAME}}, {{INV_NUM}}, {{YEAR}} The program will take the formatting of these elements (font, size, etc.) 2. Select an Excel file with the data you want to insert into the template 3. In the left column, write the name of the placeholder from the template, and in the right column, select the corresponding column from the Excel table 4. Select the folder where all documents will be saved 5. Select how the documents will be named: — by the Excel column name — or automatically by numbers (1,2,3...) 6. Click "Generate Documents". 7. Watch the progress bar. Each Excel row is one Word document.
ru: КАК РАБОТАТЬ С ПРОГРАММОЙ? 1. Выбрать шаблон Word (.doc, .docx), в котором есть плейсхолдеры, например: {{NAME}}, {{INV_NUM}}, {{YEAR}} Программа берёт форматирование этих элементов (шрифт, размер и т.д.) 2. Выбрать Excel-файл с данными, которые необходимо вставить в шаблон 3. В левой колонке напишите название плейсхолдера из шаблона, а в правой выберите соответствующую колонку из таблицы Excel 4. Выберите папку, куда будут сохранены все документы 5. Выберите, как будут названы документы: — по названию столбца Excel — или автоматически по номерам (1,2,3…) 6. Нажмите "Генерировать документы' 7. Следите за прогресс-баром. Каждая строчка Excel — один документ Word.

# EmailAuthor
source: Author's email:
ru: Почта автора:

# AppNameHelp
source: Help
ru: Помощь
